Revit 2027 API
Connector.PressureDrop Property
 The pressure drop of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double PressureDrop { get; }
Public ReadOnly Property PressureDrop As Double
	Get
public:
property double PressureDrop {
	double get ();
}
member PressureDrop : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  This connector does not support flow calculation and associated properties.
Remarks
 Instantaneous pressure drop of this connector, calculated according to system.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace